# Core
brew "stow"
brew "zsh"
brew "starship"
brew "atuin"
brew "tmux"
brew "neovim"

# Navigation & Workflow
brew "yazi"
brew "lazygit"
brew "fzf"
brew "zoxide"
brew "ripgrep"
brew "fd"
brew "ast-grep"

# AI Layer
brew "llm"

# Dev Workflow
brew "mise"
brew "direnv"
brew "just"
brew "watchexec"
brew "hyperfine"
brew "mosh"
brew "xxh"
brew "pueue"

# Git & Diff
brew "git-delta"
brew "difftastic"

# API & Network
brew "bandwhich"

# Container Tools
brew "lazydocker"

# Modern CLI Replacements
brew "bat"
brew "eza"
brew "dust"
brew "btop"
brew "procs"
brew "glow"

# Visual & Recording
brew "vhs"
# freeze: removed from homebrew-core. Install via `brew install charmbracelet/tap/freeze` if desired.

# Knowledge & Notes
brew "nb"
brew "nap"

# Correction
brew "thefuck"

# Terminal (headful only — install.sh handles conditional)
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
